In [2]:
import pandas as pd

In [3]:
df = pd.read_csv ("C:/Users/Sisay/Desktop/Resources/pymoli.txt")

In [4]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
df.tail()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [6]:
df.shape

(780, 7)

In [7]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [8]:
df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
Purchase ID    780 non-null int64
SN             780 non-null object
Age            780 non-null int64
Gender         780 non-null object
Item ID        780 non-null int64
Item Name      780 non-null object
Price          780 non-null float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.7+ KB

In [10]:
df.isna().count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

## Player Count

In [11]:
# Total nummber of players are unique players 
unique_players = df["SN"].unique
#unique_players

In [12]:
Total_payers = df["SN"].count()
Total_payers

780

## Purchasing Analysis (Total)

In [17]:
# Number of Unique Items
Unique_Items = df["Item ID"].unique
#Unique_Items

In [21]:
Unique_Items_count = len(df["Item Name"].unique())

In [22]:
#Average Purchase Price

Average_Price = (df["Price"].sum())/(df["Price"].count()).round(2)
Average_Price

3.0509871794871795

In [23]:
#Total Number of Purchases
Total_Purchases  = df["Item Name"].count()
Total_Purchases

780

In [17]:
Total = len(df["Item Name"])
Total

780

In [18]:
#Total Revenue
Total_Revenue = df["Price"].sum()
Total_Revenue

2379.77

In [19]:
Purchasing_analysis = pd.DataFrame({"Unique Items Count": [Unique_Items_count],
                            "Average Price": [Average_Price], 
                            "Total Purchases": [Total_Purchases],
                            "Total Revenue" : [Total_Revenue]})
Purchasing_analysis.head()

   Unique Items Count  Average Price  Total Purchases  Total Revenue
0                 179       3.050987              780        2379.77

## Gender Demographics

A) Percentage and Count of Male Players
B) Percentage and Count of Female Players
C) Percentage and Count of Other / Non-Disclosed

In [20]:
#Percentage and Count of Male Players
Total_Gender = df["Gender"].count()
Total_Gender

780

In [21]:
#Male Count
male_count = df[df["Gender"] == "Male"].count()
male_count

Purchase ID    652
SN             652
Age            652
Gender         652
Item ID        652
Item Name      652
Price          652
dtype: int64

In [22]:
# Males Count
male_count = df[df["Gender"] == "Male"]["SN"].count()
male_count

652

In [23]:
#Percent Males
Percent_Males = ((male_count/Total_Gender)*100).round(2)
Percent_Males

83.59

In [24]:
# Females Count 
Females_count = df[df["Gender"] =="Female"]["SN"].count()
Females_count

113

In [25]:
#Percent Females
Percent_Females = ((Females_count/Total_Gender)*100).round(2)
Percent_Females

14.49

In [26]:
# Percentage and Count of Other / Non-Disclosed
Non_Disclosed_Gender = (Total_Gender - male_count - Females_count)
Non_Disclosed_Gender

15

In [27]:
Non_Disclosed_Percentage = ((Non_Disclosed_Gender/Total_Gender)*100).round(2)
Non_Disclosed_Percentage

1.92

In [28]:
Gender_Demographics = pd.DataFrame({"Gender" : ["Male", "Female", "Non_Disclosed_Gender"], 
                   "Total Count": [male_count, Females_count, Non_Disclosed_Gender], 
                  "% Per of Players" : [Percent_Males, Percent_Females, Non_Disclosed_Percentage]})

In [29]:
Gender_Demographics.head()

                 Gender  Total Count  % Per of Players
0                  Male          652             83.59
1                Female          113             14.49
2  Non_Disclosed_Gender           15              1.92

In [30]:
Gender_Report = Gender_Demographics.set_index("Gender")
Gender_Report.style.format({"% Per of Players": "{:.2f}%"}) 
Gender_Report

                      Total Count  % Per of Players
Gender
Male                          652             83.59
Female                        113             14.49
Non_Disclosed_Gender           15              1.92

## Purchasing Analysis (Gender)

In [31]:
#The below each broken by gender
#Purchase Count
Gender_purchase = df.groupby(["Gender"])[["Item Name"]].count()

In [32]:
Gender_purchase

                       Item Name
Gender
Female                       113
Male                         652
Other / Non-Disclosed         15

In [33]:
Male_purchase = df[df["Gender"] == "Male"]["Price"].count()
Male_purchase

652

In [34]:
Female_purchase = df[df["Gender"] == "Female"]["Price"].count()
Female_purchase

113

In [35]:
Others_non_disclosed = df[df["Gender"] == "Other / Non-Disclosed"]["Price"].count()
Others_non_disclosed

15

In [36]:
#Average Purchase Price
Price_by_Gender = df.groupby(["Gender"])[["Price"]].mean().round(2)
Price_by_Gender

                       Price
Gender
Female                  3.20
Male                    3.02
Other / Non-Disclosed   3.35

In [37]:
# Avg purchase value by men
Male_purchase = df[df["Gender"] == "Male"]["Price"].mean()
Male_purchase

3.0178527607361953

In [38]:
#Avg purchase value by female
Female_purchase = df[df["Gender"] == "Female"]["Price"].mean()
Female_purchase

3.203008849557519

In [39]:
Other_Non_Disclosed = df[df["Gender"] == "Other / Non-Disclosed"]["Price"].mean()
Female_purchase

3.203008849557519

In [40]:
# Total Purchase by Males
Male_purchase_price = df[df["Gender"] == "Male"]["Price"].sum()
Male_purchase_price

1967.64

In [41]:
# Total Purchase by Females
Female_purchase_price = df[df["Gender"] == "Female"]["Price"].sum()
Female_purchase_price

361.94

In [42]:
# Total Purchase by Others
Others_purchase_price = df[df["Gender"] == "Other / Non-Disclosed"]["Price"].sum()
Others_purchase_price

50.19

In [43]:
#Average Purchase Total per Person by Gender
Ave_male_purchase = Male_purchase_price/male_count
Ave_male_purchase

3.0178527607361967

In [44]:
Ave_female_purchase = Male_purchase_price/Females_count
Ave_female_purchase

17.412743362831858

In [45]:
Ave_Others_purchase = Male_purchase_price/Non_Disclosed_Gender
Ave_Others_purchase

131.17600000000002

In [46]:
Purchasing_Analysis = pd.DataFrame({"Gender": ["Male" , "Female", "Others"], 
                                    "Purchase Count":[Male_purchase, Female_purchase, Others_non_disclosed],
                                    "Total Purchase Price": [Male_purchase_price,Female_purchase_price, Others_purchase_price],
                                    "Avg Purchase by Gender" : [Ave_male_purchase,Ave_female_purchase,Ave_Others_purchase]})

In [47]:
Purchasing_Analysis

   Gender  Purchase Count  Total Purchase Price  Avg Purchase by Gender
0    Male        3.017853               1967.64                3.017853
1  Female        3.203009                361.94               17.412743
2  Others       15.000000                 50.19              131.176000

In [48]:
Purchasing_Analysis = Purchasing_Analysis.set_index("Gender")

In [49]:
Purchasing_Analysis.style.format({"Purchasing_Analysis": "${:.2f}", 
                                  "Total Purchase Price": "${:.2f}", 
                                  "Avg Purchase by Gender": "${:.2f}"})

## Age Demographics

In [50]:
#Age Demographics

#The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)

#Purchase Count
#Average Purchase Price
#Total Purchase Value
#Average Purchase Total per Person by Age Group

In [51]:
bins = [0, 10, 19, 29, 39, 49, 59, 69, 79, 89, 99]
names = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '34- 39', '40-44', '45-49', '50-54']

In [52]:
df["AgeRange"] = pd.cut(df["Age"], bins, labels=names)

In [53]:
Age_range = df["AgeRange"].count()
Age_range

780

In [54]:
#Purchase count by age group
Age_group_purchase_count = df.groupby(["AgeRange", "Price"])["AgeRange"].count()
Age_group_purchase_count.head()

AgeRange  Price
<10       1.29     1
          1.61     1
          1.75     1
          2.05     2
          2.38     1
Name: AgeRange, dtype: int64

In [55]:
#Average Purchase Price
Age_group_purchase_avg = df.groupby(["AgeRange", "Price"])["AgeRange"].count()
Age_group_purchase_avg.head()

AgeRange  Price
<10       1.29     1
          1.61     1
          1.75     1
          2.05     2
          2.38     1
Name: AgeRange, dtype: int64

In [56]:
#Total Purchase Value
Age_group_purchase_total = df.groupby(["AgeRange", "Price"])["Price"].sum()
Age_group_purchase_total.head()

AgeRange  Price
<10       1.29     1.29
          1.61     1.61
          1.75     1.75
          2.05     4.10
          2.38     2.38
Name: Price, dtype: float64

In [57]:
#Average Purchase Total per Person by Age Group
Avg_purchase_total_age_group = (Age_group_purchase_total)/(Age_range)
Avg_purchase_total_age_group.head().round(4)

AgeRange  Price
<10       1.29     0.0017
          1.61     0.0021
          1.75     0.0022
          2.05     0.0053
          2.38     0.0031
Name: Price, dtype: float64

In [58]:
Age_Group_Purchase = pd.DataFrame({"Count": Age_group_purchase_count,
                         "Agerage" : Age_group_purchase_avg,
                        "Total": Age_group_purchase_total})
Age_Group_Purchase.head()

                Count  Agerage  Total
AgeRange Price
<10      1.29       1        1   1.29
         1.61       1        1   1.61
         1.75       1        1   1.75
         2.05       2        2   4.10
         2.38       1        1   2.38

## Top Spenders

In [59]:
players_purchase_count = df.groupby("SN").count()["Price"]
players_purchase_count.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Price, dtype: int64

In [60]:
players_purchase_avarage= df.groupby(["SN"]).mean()["Price"].round(2)
players_purchase_avarage.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [61]:
players_purchase_total = df.groupby(["SN"]).sum()["Price"]
players_purchase_total.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [62]:
#Converting to data frame
Spending_by_players = pd.DataFrame({"Purchase Count":players_purchase_count,
                                   "Item Average Price": players_purchase_avarage,
                                   "Total Purchase Value": players_purchase_total})
Spending_by_players.head()

              Purchase Count  Item Average Price  Total Purchase Value
SN
Adairialis76               1                2.28                  2.28
Adastirin33                1                4.48                  4.48
Aeda94                     1                4.91                  4.91
Aela59                     1                4.32                  4.32
Aelaria33                  1                1.79                  1.79

In [63]:
#Soritng to show the five top spenders
Top_Five_Spenders_Total = Spending_by_players.sort_values("Total Purchase Value", ascending = False)
Top_Five_Spenders_Total.head()

             Purchase Count  Item Average Price  Total Purchase Value
SN
Lisosia93                 5                3.79                 18.96
Idastidru52               4                3.86                 15.45
Chamjask73                3                4.61                 13.83
Iral74                    4                3.40                 13.62
Iskadarya95               3                4.37                 13.10

In [64]:
Top_Five_Spenders_Count = Spending_by_players.sort_values("Purchase Count", ascending = False)
Top_Five_Spenders_Count.head()

             Purchase Count  Item Average Price  Total Purchase Value
SN
Lisosia93                 5                3.79                 18.96
Iral74                    4                3.40                 13.62
Idastidru52               4                3.86                 15.45
Asur53                    3                2.48                  7.44
Inguron55                 3                3.70                 11.11

In [65]:
Top_Five_Spenders_Avg = Spending_by_players.sort_values("Item Average Price", ascending = False)
Top_Five_Spenders_Avg.head()

                Purchase Count  Item Average Price  Total Purchase Value
SN
Dyally87                     1                4.99                  4.99
Yarithsurgue62               1                4.94                  4.94
Chanirrasta87                1                4.94                  4.94
Lirtilsa71                   1                4.94                  4.94
Ririp86                      1                4.94                  4.94

## Most Popular Items

<div class="alert alert-block alert-success">
Five most popular items by purchase count, then in the table 
A) Item ID
B) Item Name
C) Purchase Count
D) Item Price
E) Total Purchase Value

In [66]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,AgeRange
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,25-29
2,2,Ithergue48,24,Male,92,Final Critic,4.88,15-19
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,15-19
4,4,Iskosia90,23,Male,131,Fury,1.44,15-19

In [67]:
Most_items = df.groupby(["Item ID", "Item Name", "Price"])["Price"].agg(["count", "sum"])
Most_items.head()

                                  count    sum
Item ID Item Name          Price
0       Splinter           1.28       4   5.12
1       Crucifer           3.26       3   9.78
2       Verdict            2.48       6  14.88
3       Phantomlight       2.49       6  14.94
4       Bloodlord's Fetish 1.70       5   8.50

In [68]:
Most_items.columns = ["Purchase Count", "Purchase Total Value"]
Most_items.head()

                                  Purchase Count  Purchase Total Value
Item ID Item Name          Price
0       Splinter           1.28                4                  5.12
1       Crucifer           3.26                3                  9.78
2       Verdict            2.48                6                 14.88
3       Phantomlight       2.49                6                 14.94
4       Bloodlord's Fetish 1.70                5                  8.50

In [69]:
Most_items.reset_index(inplace = True)

In [70]:
Most_items.set_index(["Item ID","Item Name"] ,inplace=True)

In [71]:
Most_items = Most_items[["Purchase Count", "Price", "Purchase Total Value"]]

In [72]:
Most_Pop_Items = Most_items.sort_values(by="Purchase Count", ascending = False)
Most_Pop_Items.head()

,,Purchase Count,Price,Purchase Total Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

 Five most profitable items by total purchase value, then list (in a table):
    A) Item ID
    B) Item Name
    C) Purchase Count
    D) Item Price
    E) Total Purchase Value

In [73]:
Most_profit = Most_Pop_Items.sort_values(by="Purchase Total Value", ascending = False)
Most_profit.head()

,,Purchase Count,Price,Purchase Total Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80